; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_2 ?v9 ?v11)
             (pred_9 ?v5 ?v6)
             (pred_5 ?v9 ?v6)
             (pred_6 ?v13 ?v9 )
	     (pred_3 ?v9)
             (pred_4 ?v2)
             (pred_11 ?v5)
             (pred_7 ?v6)
             (pred_10 ?v9)
             (pred_1 ?v5)
             (pred_8 ?v9)
             (pred_12 ))



(:action op_1
:parameters (?v10 ?v7 ?v8 ?v1)
:precondition (and (pred_4 ?v10) (pred_4 ?v7) (pred_11 ?v8) (pred_7 ?v1)
          (pred_2 ?v10 ?v7) (pred_9 ?v8 ?v1)
                   (pred_5 ?v7 ?v1) (pred_3 ?v10) 
                   (pred_10 ?v7) (pred_1 ?v8))
:effect (and  (pred_8 ?v7) (not (pred_10 ?v7))))


(:action op_2
:parameters (?v10 ?v12)
:precondition (and (pred_4 ?v10) (pred_4 ?v12)
               (pred_3 ?v10) (pred_2 ?v10 ?v12) (pred_8 ?v12))
:effect (and (pred_3 ?v12) (not (pred_3 ?v10))))

(:action op_5
:parameters (?v10 ?v8)
:precondition (and (pred_4 ?v10) (pred_11 ?v8) 
                  (pred_3 ?v10) (pred_6 ?v8 ?v10) (pred_12 ))
:effect (and (pred_1 ?v8)
   (not (pred_6 ?v8 ?v10)) (not (pred_12 ))))


(:action op_4
:parameters (?v10 ?v3 ?v4)
:precondition (and (pred_4 ?v10) (pred_11 ?v3) (pred_11 ?v4)
                  (pred_3 ?v10) (pred_1 ?v4) (pred_6 ?v3 ?v10))
:effect (and (pred_1 ?v3) (pred_6 ?v4 ?v10)
        (not (pred_1 ?v4)) (not (pred_6 ?v3 ?v10))))

(:action op_3
:parameters (?v10 ?v8)
:precondition (and (pred_4 ?v10) (pred_11 ?v8) 
                  (pred_3 ?v10) (pred_1 ?v8))
:effect (and (pred_12 ) (pred_6 ?v8 ?v10) (not (pred_1 ?v8)))))

; problem
(define (problem grid-4-4-3-3-3)
    (:domain grid)
    (:objects
    obj_12 obj_18 obj_21 obj_14 obj_01 obj_04 obj_13 obj_22 obj_03 obj_10 obj_19 obj_06 obj_20 obj_11 obj_07 obj_08
    obj_09 obj_17 obj_05
    obj_02 obj_15 obj_16
    )

    (:init
       (pred_12)

       (pred_4 obj_12)
       (pred_4 obj_18)
       (pred_4 obj_21)
       (pred_4 obj_14)
       (pred_4 obj_01)
       (pred_4 obj_04)
       (pred_4 obj_13)
       (pred_4 obj_22)
       (pred_4 obj_03)
       (pred_4 obj_10)
       (pred_4 obj_19)
       (pred_4 obj_06)
       (pred_4 obj_20)
       (pred_4 obj_11)
       (pred_4 obj_07)
       (pred_4 obj_08)
       (pred_7 obj_09)
       (pred_7 obj_17)
       (pred_7 obj_05)
       (pred_11 obj_02)
       (pred_11 obj_15)
       (pred_11 obj_16)

       (pred_2 obj_12 obj_01)
       (pred_2 obj_12 obj_18)
       (pred_2 obj_18 obj_04)
       (pred_2 obj_18 obj_21)
       (pred_2 obj_18 obj_12)
       (pred_2 obj_21 obj_13)
       (pred_2 obj_21 obj_14)
       (pred_2 obj_21 obj_18)
       (pred_2 obj_14 obj_22)
       (pred_2 obj_14 obj_21)
       (pred_2 obj_01 obj_03)
       (pred_2 obj_01 obj_04)
       (pred_2 obj_01 obj_12)
       (pred_2 obj_04 obj_10)
       (pred_2 obj_04 obj_13)
       (pred_2 obj_04 obj_18)
       (pred_2 obj_04 obj_01)
       (pred_2 obj_13 obj_19)
       (pred_2 obj_13 obj_22)
       (pred_2 obj_13 obj_21)
       (pred_2 obj_13 obj_04)
       (pred_2 obj_22 obj_06)
       (pred_2 obj_22 obj_14)
       (pred_2 obj_22 obj_13)
       (pred_2 obj_03 obj_20)
       (pred_2 obj_03 obj_10)
       (pred_2 obj_03 obj_01)
       (pred_2 obj_10 obj_11)
       (pred_2 obj_10 obj_19)
       (pred_2 obj_10 obj_04)
       (pred_2 obj_10 obj_03)
       (pred_2 obj_19 obj_07)
       (pred_2 obj_19 obj_06)
       (pred_2 obj_19 obj_13)
       (pred_2 obj_19 obj_10)
       (pred_2 obj_06 obj_08)
       (pred_2 obj_06 obj_22)
       (pred_2 obj_06 obj_19)
       (pred_2 obj_20 obj_11)
       (pred_2 obj_20 obj_03)
       (pred_2 obj_11 obj_07)
       (pred_2 obj_11 obj_10)
       (pred_2 obj_11 obj_20)
       (pred_2 obj_07 obj_08)
       (pred_2 obj_07 obj_19)
       (pred_2 obj_07 obj_11)
       (pred_2 obj_08 obj_06)
       (pred_2 obj_08 obj_07)
       (pred_10 obj_13)
       (pred_10 obj_12)
       (pred_10 obj_18)
       (pred_5  obj_13 obj_09)
       (pred_5  obj_12 obj_17)
       (pred_5  obj_18 obj_05)
       (pred_8 obj_21)
       (pred_8 obj_14)
       (pred_8 obj_01)
       (pred_8 obj_04)
       (pred_8 obj_22)
       (pred_8 obj_03)
       (pred_8 obj_10)
       (pred_8 obj_19)
       (pred_8 obj_06)
       (pred_8 obj_20)
       (pred_8 obj_11)
       (pred_8 obj_07)
       (pred_8 obj_08)

       (pred_9  obj_02 obj_09)
       (pred_9  obj_15 obj_17)
       (pred_9  obj_16 obj_05)
       (pred_6 obj_02 obj_10)
       (pred_6 obj_15 obj_20)
       (pred_6 obj_16 obj_20)
       (pred_3 obj_01)
    )

    (:goal (and
       (pred_6 obj_02 obj_14)
       (pred_6 obj_15 obj_12)
    ))
(:constraints
  (always (not (pred_3 obj_04)))
)
)

; plan
1. (op_2 obj_01 obj_03)
   deleted: (pred_3 obj_01)
   added: (pred_3 obj_03)
   goals met: 0 of 2
2. (op_2 obj_03 obj_20)
   deleted: (pred_3 obj_03)
   added: (pred_3 obj_20)
   goals met: 0 of 2
3. (op_5 obj_20 obj_15)
   deleted: (pred_6 obj_15 obj_20) (pred_12)
   added: (pred_1 obj_15)
   goals met: 0 of 2
4. (op_2 obj_20 obj_03)
   deleted: (pred_3 obj_20)
   added: (pred_3 obj_03)
   goals met: 0 of 2
5. (op_2 obj_03 obj_01)
   deleted: (pred_3 obj_03)
   added: (pred_3 obj_01)
   goals met: 0 of 2
6. (op_1 obj_01 obj_12 obj_15 obj_17)
   deleted: (pred_10 obj_12)
   added: (pred_8 obj_12)
   goals met: 0 of 2
7. (op_2 obj_01 obj_12)
   deleted: (pred_3 obj_01)
   added: (pred_3 obj_12)
   goals met: 0 of 2
8. (op_3 obj_12 obj_15)
   deleted: (pred_1 obj_15)
   added: (pred_12) (pred_6 obj_15 obj_12)
   goals met: 1 of 2
9. (op_2 obj_12 obj_01)
   deleted: (pred_3 obj_12)
   added: (pred_3 obj_01)
   goals met: 1 of 2
10. (op_2 obj_01 obj_03)
   deleted: (pred_3 obj_01)
   added: (pred_3 obj_03)
   goals met: 1 of 2
11. (op_2 obj_03 obj_10)
   deleted: (pred_3 obj_03)
   added: (pred_3 obj_10)
   goals met: 1 of 2
12. (op_5 obj_10 obj_02)
   deleted: (pred_6 obj_02 obj_10) (pred_12)
   added: (pred_1 obj_02)
   goals met: 1 of 2
13. (op_2 obj_10 obj_19)
   deleted: (pred_3 obj_10)
   added: (pred_3 obj_19)
   goals met: 1 of 2
14. (op_2 obj_19 obj_06)
   deleted: (pred_3 obj_19)
   added: (pred_3 obj_06)
   goals met: 1 of 2
15. (op_2 obj_06 obj_22)
   deleted: (pred_3 obj_06)
   added: (pred_3 obj_22)
   goals met: 1 of 2
16. (op_2 obj_22 obj_14)
   deleted: (pred_3 obj_22)
   added: (pred_3 obj_14)
   goals met: 1 of 2
17. (op_3 obj_14 obj_02)
   deleted: (pred_1 obj_02)
   added: (pred_12) (pred_6 obj_02 obj_14)
   goals met: 2 of 2
